Repository: UTSA-ICS/sid-server
Catalog: sidserver/locale/*/LC_MESSAGES/keystone-log-info.po
Languages: fr, zh_cn

source: Creating the default role %s because it does not exist.
fr: Création du rôle par défaut %s, car il n'existe pas
zh_cn: 正在创建默认角色%s，因为它之前不存在。

source: Loading auth-plugins by class-name is deprecated.
fr: Chargement de auth-plugins par class-name est déprécié
zh_cn: 通过class-name（类名）加载auth-plugins（认证插件）的方式已被弃用。

source: "expires_at" has conflicting values %(existing)s and %(new)s. Will use the earliest value.
fr: "expires_at" a des valeurs conflictuelles %(existing)s et %(new)s. Utilsation de la première valeur.
zh_cn: "expires_at" 被赋予矛盾的值： %(existing)s 和 %(new)s。将采用时间上较早的那个值。

source: Running command - %s
fr: Exécution de la commande %s
zh_cn: 正在运行命令 - %s

source: No bind information present in token
fr: Aucune information d'attachement n'est présente dans le jeton
zh_cn: 令牌中暂无绑定信息

source: Named bind mode %s not in bind information
fr: Le mode d'attachement nommé %s n'est pas dans l'information d'attachement
zh_cn: 在绑定信息中没有命名绑定模式%s

source: Kerberos credentials required and not present
fr: L'identitification Kerberos est requise mais non présente
zh_cn: 没有所需的Kerberos凭证

source: Kerberos credentials do not match those in bind
fr: L'identification Kerberos ne correspond pas à celle de l'attachement
zh_cn: 在绑定中没有匹配的Kerberos凭证

source: Kerberos bind authentication successful
fr: Attachement Kerberos identifié correctement
zh_cn: Kerberos绑定认证成功

source: Couldn't verify unknown bind: {%(bind_type)s: %(identifier)s}
fr: Impossible de vérifier l'attachement inconnu: {%(bind_type)s: %(identifier)s}
zh_cn: 不能验证未知绑定: {%(bind_type)s: %(identifier)s}

source: Starting %(arg0)s on %(host)s:%(port)s
fr: Démarrage de %(arg0)s sur %(host)s:%(port)s
zh_cn: 正在 %(host)s:%(port)s 上启动 %(arg0)s

source: Adding proxy '%(proxy)s' to KVS %(name)s.
fr: Ahour du mandataire '%(proxy)s' au KVS %(name)s.
zh_cn: 正在将代理'%(proxy)s'加入KVS %(name)s 中。

source: Using %(func)s as KVS region %(name)s key_mangler
fr: Utilise %(func)s comme région KVS %(name)s key_mangler
zh_cn: 使用 %(func)s 作为KVS域 %(name)s 的key_mangler处理函数

source: Using default dogpile sha1_mangle_key as KVS region %s key_mangler
fr: Utilisation du dogpile sha1_mangle_key par défaut comme région KVS %s key_mangler
zh_cn: 使用默认的dogpile sha1_mangle_key函数作为KVS域 %s 的key_mangler处理函数

source: KVS region %s key_mangler disabled.
fr: Région KVS %s key_mangler désactivée
zh_cn: KVS域 %s 的key_mangler处理函数被禁用。

source: Received the following notification: service %(service)s, resource_type: %(resource_type)s, operation %(operation)s payload %(payload)s
fr: Réception de la notification suivante: service %(service)s, resource_type: %(resource_type)s, operation %(operation)s payload %(payload)s

source: Eventlet backdoor listening on %(port)s for process %(pid)d
fr: Eventlet backdoor en écoute sur le port %(port)s for process %(pid)d
zh_cn: 携程为进程 %(pid)d 在后台监听 %(port)s

source: Caught %s, exiting
fr: %s interceptée, sortie
zh_cn: 捕获到 %s，正在退出

source: Parent process has died unexpectedly, exiting
fr: Processus parent arrêté de manière inattendue, sortie
zh_cn: 父进程已意外终止，正在退出

source: Child caught %s, exiting
fr: L'enfant a reçu %s, sortie
zh_cn: 子代捕获 %s，正在退出

source: Forking too fast, sleeping
fr: Bifurcation trop rapide, pause
zh_cn: 派生速度太快，正在休眠

source: Started child %d
fr: Enfant démarré %d
zh_cn: 已启动子代 %d

source: Starting %d workers
fr: Démarrage des travailleurs %d
zh_cn: 正在启动 %d 工作程序

source: Child %(pid)d killed by signal %(sig)d
fr: Enfant %(pid)d arrêté par le signal %(sig)d
zh_cn: 信号 %(sig)d 已终止子代 %(pid)d

source: Child %(pid)s exited with status %(code)d
fr: Processus fils %(pid)s terminé avec le status %(code)d
zh_cn: 子代 %(pid)s 已退出，状态为 %(code)d

source: Caught %s, stopping children
fr: %s interceptée, arrêt de l'enfant
zh_cn: 捕获到 %s，正在停止子代

source: Wait called after thread killed. Cleaning up.
fr: Pause demandée après suppression de thread. Nettoyage.
zh_cn: 线程结束，正在清理

source: Waiting on %d children to exit
fr: En attente %d enfants pour sortie
zh_cn: 正在等待 %d 个子代退出

source: Total expired tokens removed: %d
fr: Total des jetons expirés effacés: %d
zh_cn: 被移除的失效令牌总数：%d
